[
  {
    "theme": {
      "name_en": "Trust in Allah",
      "name_ar": "تَوَكُّل",
      "slug": "tawakkul"
    },
    "ayah": {
      "arabic": "وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ",
      "translation": "And whoever puts their trust in Allah – He is sufficient for them.",
      "reference": "Surah At-Talaq, 65:3"
    },
    "tafsir": "This ayah is a quiet promise for hearts overwhelmed by uncertainty. Tawakkul doesn’t mean doing nothing — it means doing your part, then handing over the outcome to the One who sees what you cannot. When you trust Allah fully, He fills in the gaps. He carries what you can’t. He becomes enough — not just for your needs, but for your soul."
  },
  {
    "theme": {
      "name_en": "Trust in Allah",
      "name_ar": "تَوَكُّل",
      "slug": "tawakkul"
    },
    "ayah": {
      "arabic": "إِنَّ اللَّهَ يُدَافِعُ عَنِ الَّذِينَ آمَنُوا",
      "translation": "Indeed, Allah defends those who have believed.",
      "reference": "Surah Al-Hajj, 22:38"
    },
    "tafsir": "Even when you feel under attack, unseen and unsupported — Allah is in your corner. He defends you in ways you may never see. Trusting Him means knowing that the unseen protections are stronger than any visible threat."
  },
  {
    "theme": {
      "name_en": "Trust in Allah",
      "name_ar": "تَوَكُّل",
      "slug": "tawakkul"
    },
    "ayah": {
      "arabic": "وَتَوَكَّلْ عَلَى الْحَيِّ الَّذِي لَا يَمُوتُ",
      "translation": "And rely upon the Ever-Living who does not die.",
      "reference": "Surah Al-Furqan, 25:58"
    },
    "tafsir": "Everything else fades. People forget. Systems fail. But the One who never dies — never sleeps — never abandons you — that’s where real reliance brings peace. Tawakkul is handing your fragile heart to the One who never breaks."
  },
  {
    "theme": {
      "name_en": "Gratitude",
      "name_ar": "شُكْر",
      "slug": "shukr"
    },
    "ayah": {
      "arabic": "لَئِن شَكَرْتُمْ لَأَزِيدَنَّكُمْ",
      "translation": "If you are grateful, I will surely increase you [in favor].",
      "reference": "Surah Ibrahim, 14:7"
    },
    "tafsir": "Gratitude isn’t just a feeling — it's a form of worship. When you truly recognize blessings and thank Allah, He promises increase — not just in what you have, but in your capacity to appreciate and enjoy it. Shukr opens the gates of abundance, inward and outward."
  },
  {
    "theme": {
      "name_en": "Gratitude",
      "name_ar": "شُكْر",
      "slug": "shukr"
    },
    "ayah": {
      "arabic": "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ",
      "translation": "So remember Me; I will remember you. And be grateful to Me and do not deny Me.",
      "reference": "Surah Al-Baqarah, 2:152"
    },
    "tafsir": "Allah doesn't need your gratitude — *you* need it. Shukr makes your heart soft, your vision clear, and your soul receptive. Every act of remembering Him is a pathway back to presence, back to peace."
  },
  {
    "theme": {
      "name_en": "Gratitude",
      "name_ar": "شُكْر",
      "slug": "shukr"
    },
    "ayah": {
      "arabic": "وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِن شَكَرْتُمْ لَأَزِيدَنَّكُمْ",
      "translation": "And [remember] when your Lord proclaimed: If you are grateful, I will surely increase you.",
      "reference": "Surah Ibrahim, 14:7"
    },
    "tafsir": "The divine promise repeats — not by accident. Gratitude invites more. Not just materially, but spiritually. The grateful heart expands to see even hardship as wrapped in hidden mercy."
  },
  {
    "theme": {
      "name_en": "Patience",
      "name_ar": "صَبْر",
      "slug": "sabr"
    },
    "ayah": {
      "arabic": "إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
      "translation": "Indeed, Allah is with the patient.",
      "reference": "Surah Al-Baqarah, 2:153"
    },
    "tafsir": "Patience isn't passive. It's an act of silent strength. This verse reminds us that when you endure without giving up, you’re not alone — Allah is with you. His nearness is the reward for your struggle."
  },
  {
    "theme": {
      "name_en": "Patience",
      "name_ar": "صَبْر",
      "slug": "sabr"
    },
    "ayah": {
      "arabic": "فَصَبْرٌ جَمِيلٌ",
      "translation": "So patience is most fitting.",
      "reference": "Surah Yusuf, 12:18"
    },
    "tafsir": "When the pain is too deep and the answers are far — a beautiful patience is what Prophet Yaqub clung to. Not bitterness, not blame. Just quiet trust in Allah's timing, even when the wait feels unbearable."
  },
  {
    "theme": {
      "name_en": "Patience",
      "name_ar": "صَبْر",
      "slug": "sabr"
    },
    "ayah": {
      "arabic": "وَبَشِّرِ الصَّابِرِينَ",
      "translation": "And give good news to the patient.",
      "reference": "Surah Al-Baqarah, 2:155"
    },
    "tafsir": "Patience is hard. That’s why Allah follows it with good news. Your tears, your stillness, your quiet perseverance — none of it goes unnoticed. There's glad tidings written for those who hold on."
  },
  {
    "theme": {
      "name_en": "Repentance",
      "name_ar": "تَوْبَة",
      "slug": "tawbah"
    },
    "ayah": {
      "arabic": "إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ",
      "translation": "Indeed, Allah loves those who repent often.",
      "reference": "Surah Al-Baqarah, 2:222"
    },
    "tafsir": "It’s not falling that distances you from Allah — it’s staying down. Tawbah isn’t shame — it’s beloved. This verse reminds us that Allah doesn’t just forgive — He *loves* the ones who keep coming back."
  },
  {
    "theme": {
      "name_en": "Repentance",
      "name_ar": "تَوْبَة",
      "slug": "tawbah"
    },
    "ayah": {
      "arabic": "قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ",
      "translation": "Say, 'O My servants who have transgressed against themselves, do not despair of the mercy of Allah.'",
      "reference": "Surah Az-Zumar, 39:53"
    },
    "tafsir": "No sin is too big. No darkness too deep. This ayah is a lifeline for every soul drowning in guilt — a Divine call back to mercy. Don’t give up. Allah hasn’t given up on you."
  },
  {
    "theme": {
      "name_en": "Repentance",
      "name_ar": "تَوْبَة",
      "slug": "tawbah"
    },
    "ayah": {
      "arabic": "وَهُوَ الَّذِي يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ",
      "translation": "And it is He who accepts repentance from His servants.",
      "reference": "Surah Ash-Shura, 42:25"
    },
    "tafsir": "Repentance isn’t a rejection — it’s an invitation. Allah made it part of our journey — not a shameful exception. This ayah assures you: your return is always accepted, always welcome."
  },
  {
    "theme": {
      "name_en": "Hope",
      "name_ar": "أَمَل",
      "slug": "amal"
    },
    "ayah": {
      "arabic": "إِنَّ مَعَ الْعُسْرِ يُسْرًا",
      "translation": "Indeed, with hardship comes ease.",
      "reference": "Surah Ash-Sharh, 94:6"
    },
    "tafsir": "It’s not after hardship. It’s *with* it. This ayah gives hope in the present moment — that ease is folded into difficulty like morning light hidden in night. You’re not just waiting for ease. You’re already walking with it."
  },
  {
    "theme": {
      "name_en": "Hope",
      "name_ar": "أَمَل",
      "slug": "amal"
    },
    "ayah": {
      "arabic": "وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ",
      "translation": "And My mercy encompasses all things.",
      "reference": "Surah Al-A'raf, 7:156"
    },
    "tafsir": "Your past? His mercy covers it. Your future? His mercy awaits it. When you feel undeserving, remember this — Allah’s mercy is bigger than every flaw, every wound, every story you carry."
  },
  {
    "theme": {
      "name_en": "Hope",
      "name_ar": "أَمَل",
      "slug": "amal"
    },
    "ayah": {
      "arabic": "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا",
      "translation": "So, indeed with hardship comes ease.",
      "reference": "Surah Ash-Sharh, 94:5"
    },
    "tafsir": "Allah repeats it. For the doubter. For the one barely holding on. Hope isn’t wishful — it’s a Divine decree. Your difficulty isn’t forever. Ease is already written alongside it."
  },
  {
    "theme": {
      "name_en": "Purpose",
      "name_ar": "قَصْد",
      "slug": "qasd"
    },
    "ayah": {
      "arabic": "وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ",
      "translation": "And I did not create jinn and humans except to worship Me.",
      "reference": "Surah Adh-Dhariyat, 51:56"
    },
    "tafsir": "You weren’t created randomly. Not for chasing metrics or moods. This verse realigns you with your original design — to live meaningfully, through connection to the Divine."
  },
  {
    "theme": {
      "name_en": "Purpose",
      "name_ar": "قَصْد",
      "slug": "qasd"
    },
    "ayah": {
      "arabic": "فَأَيْنَ تَذْهَبُونَ",
      "translation": "So where are you going?",
      "reference": "Surah At-Takwir, 81:26"
    },
    "tafsir": "It’s the ultimate pause. A question from Allah that pierces your day-to-day. Where *are* you going? What’s driving you? This is purpose calling you home — to realign, reset, and return."
  },
  {
    "theme": {
      "name_en": "Purpose",
      "name_ar": "قَصْد",
      "slug": "qasd"
    },
    "ayah": {
      "arabic": "قَدْ أَفْلَحَ مَن زَكَّاهَا",
      "translation": "He has succeeded who purifies it.",
      "reference": "Surah Ash-Shams, 91:9"
    },
    "tafsir": "Success isn’t just external. It’s internal — the one who purifies their soul wins. This is the Quran’s reminder that growth, meaning, and legacy all begin with your inner self."
  }
]